performance_test/FindAllPosts.yml
config:
  target: "http://localhost:3333"
  phases:
    - duration: 10
      arrivalRate: 10
  variables:
    name: "braga"
    page: 1
    perPage: 50

scenarios:
  - name: "Find posts by name"
    flow:
      - get:
          url: "/posts/Credit/1/50"
          expect:
            - statusCode: 200