performance_test/FindAllUsers.yml
config:
  target: "http://localhost:3333"
  phases:
    - duration: 10
      arrivalRate: 400
  variables:
    name: "braga"
    page: 1
    perPage: 50

scenarios:
  - name: "Find users by name"
    flow:
      - get:
          url: "/users/Flora/1/10"
          expect:
            - statusCode: 200